nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.h
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_CLOCK_H_
#define FSL_CLOCK_H_

#include "fsl_common.h"
#include "fsl_device_registers.h"
#include "fsl_reset.h"
#include <assert.h>
#include <stdbool.h>
#include <stdint.h>

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Definitions
 *****************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.3.1 */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(2, 3, 1))
/*@}*/

#if defined(MIMXRT798S_hifi1_SERIES) || defined(MIMXRT798S_cm33_core1_SERIES) || \
    defined(MIMXRT758S_cm33_core1_SERIES) || defined(MIMXRT735S_cm33_core1_SERIES)
#define FSL_CLOCK_DRIVER_SENSE
#elif defined(MIMXRT798S_hifi4_SERIES) || defined(MIMXRT798S_cm33_core0_SERIES) || \
    defined(MIMXRT758S_cm33_core0_SERIES) || defined(MIMXRT735S_cm33_core0_SERIES)
#define FSL_CLOCK_DRIVER_COMPUTE
#elif defined(MIMXRT798S_ezhv_SERIES) || defined(MIMXRT758S_ezhv_SERIES) || defined(MIMXRT735S_ezhv_SERIES)
#define FSL_CLOCK_DRIVER_MEDIA
#else
#error "Unsupported core!"
#endif

/* Definition for delay API in clock driver, users can redefine it to the real
 * application. */
#ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
#if defined(FSL_CLOCK_DRIVER_SENSE)
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (100000000UL)
#elif defined(FSL_CLOCK_DRIVER_COMPUTE)
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (300000000UL)
#elif defined(FSL_CLOCK_DRIVER_MEDIA)
/* EZHV process clock is m_clk. */
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (300UL * 1000UL * 1000UL)
#endif /* FSL_CLOCK_DRIVER_SENSE */
#endif /* SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY */

/* Definition for compatiblity. */
#define CLOCK_DeinitSysPfd CLOCK_DeinitMainPfd
#define CLOCK_InitSysPfd   CLOCK_InitMainPfd

/*! @brief External XTAL (SYSOSC) clock frequency.
 *
 * The XTAL (SYSOSC) clock frequency in Hz, when the clock is setup, use the
 * function CLOCK_SetXtalFreq to set the value in to clock driver. For example,
 * if XTAL is 16MHz,
 * @code
 * CLOCK_SetXtalFreq(160000000);
 * @endcode
 */
extern volatile uint32_t g_xtalFreq;

/*! @brief External CLK_IN pin clock frequency (clkin).
 *
 * The CLK_IN pin (clkin) clock frequency in Hz, when the clock is setup, use
 * the function CLOCK_SetClkinFreq to set the value in to clock driver. For
 * example, if CLK_IN is 16MHz,
 * @code
 * CLOCK_SetClkinFreq(160000000);
 * @endcode
 */
extern volatile uint32_t g_clkinFreq;

/*! @brief External 32KHz input clock frequency.
 *
 * The External 32KHz input clock frequency in Hz, used when OSC32KNP in bypass mode, use
 * the function CLOCK_Set32kClkinFreq to set the value in to clock driver. For
 * example, if EXTALIN32K input is 32768,
 * @code
 * CLOCK_Set32kClkinFreq(32768);
 * @endcode
 */
extern volatile uint32_t g_32kClkinFreq;

/*! @brief External MCLK IN clock frequency.
 *
 * The MCLK IN clock frequency in Hz, when the clock is setup, use the
 * function CLOCK_SetMclkFreq to set the value in to clock driver. For example,
 * if MCLK IN is 16MHz,
 * @code
 * CLOCK_SetMclkFreq(160000000);
 * @endcode
 */
extern volatile uint32_t g_mclkFreq;

#if defined(FSL_CLOCK_DRIVER_COMPUTE)
/*! @brief VDD1(Sense) audio_clk clock frequency.
 *
 *NOTE, The compute domain can't read the Sense VDD1 audio_clk selection. The compute domain need call
 *CLOCK_SetSenseAudioClkFreq() to tell the clock driver the frequncy of current VDD1 audio_clk, and then
 *CLOCK_GetSenseAudioClkFreq() can return the correct value.
 * @code
 * CLOCK_SetSenseAudioClkFreq(24000000);
 * @endcode
 */
extern volatile uint32_t g_senseAudioClkFreq;
#endif

/*! @brief Clock ip name array for CDOG. */
#define CDOG_CLOCKS                                                          \
    {                                                                        \
        kCLOCK_Cdog0, kCLOCK_Cdog1, kCLOCK_Cdog2, kCLOCK_Cdog3, kCLOCK_Cdog4 \
    }

/*! @brief Clock ip name array for FREQME. */
#define FREQME_CLOCKS  \
    {                  \
        kCLOCK_Freqme0 \
    }

/*! @brief Clock ip name array for GPU. */
#define GPU_CLOCKS \
    {              \
        kCLOCK_Gpu \
    }

/*! @brief Clock ip name array for MIPI DSI. */
#define MIPI_DSI_HOST_CLOCKS \
    {                        \
        kCLOCK_MipiDsiCtrl   \
    }

/*! @brief Clock ip name array for LCDIF. */
#define LCDIF_CLOCKS \
    {                \
        kCLOCK_Lcdif \
    }

/*! @brief Clock ip name array for SCT. */
#define SCT_CLOCKS  \
    {               \
        kCLOCK_Sct0 \
    }

/*! @brief Clock ip name array for USB. */
#define USB_CLOCKS               \
    {                            \
        kCLOCK_Usb0, kCLOCK_Usb1 \
    }

/*! @brief Clock ip name array for USBPHY. */
#define USBPHY_CLOCKS                  \
    {                                  \
        kCLOCK_Usbphy0, kCLOCK_Usbphy1 \
    }

/*! @brief Clock ip name array for FlexSPI */
#define XSPI_CLOCKS                              \
    {                                            \
        kCLOCK_Xspi0, kCLOCK_Xspi1, kCLOCK_Xspi2 \
    }

/*! @brief Clock ip name array for MMU */
#define MMU_CLOCKS                            \
    {                                         \
        kCLOCK_Mmu0, kCLOCK_Mmu1, kCLOCK_Mmu2 \
    }

/*! @brief Clock ip name array for CACHE64 */
#define CACHE64_CLOCKS                           \
    {                                            \
        kCLOCK_Cache64ctrl0, kCLOCK_Cache64ctrl1 \
    }

/*! @brief Clock ip name array for CACHE64_POLSEL */
#define CACHE64POLSEL_CLOCKS                         \
    {                                                \
        kCLOCK_Cache64Polsel0, kCLOCK_Cache64Polsel1 \
    }

/*! @brief Clock ip name array for ADC. */
#define LPADC_CLOCKS \
    {                \
        kCLOCK_Adc0  \
    }

/*! @brief Clock ip name array for SDADC. */
#define SDADC_CLOCKS  \
    {                 \
        kCLOCK_Sdadc0 \
    }

