nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.h
    kCLOCK_Cpu1    = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 0),         /*!< Clock gate name: CPU1*/
    kCLOCK_Mu0     = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 4),         /*!< Clock gate name: MU0*/
    kCLOCK_Mu1     = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 5),         /*!< Clock gate name: MU1*/
    kCLOCK_Mu2     = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 6),         /*!< Clock gate name: MU2*/
    kCLOCK_OsTimer = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 7),         /*!< Clock gate name: OsTimer*/
    kCLOCK_Sema420 = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 8),         /*!< Clock gate name: SEMA42_0*/
    kCLOCK_Sdadc0  = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 9),         /*!< Clock gate name: SDADC0*/
    kCLOCK_Adc0    = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 10),        /*!< Clock gate name: SARADC0*/
    kCLOCK_Acmp0   = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 11),        /*!< Clock gate name: Acmp0*/
    kCLOCK_Pdm     = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 12),        /*!< Clock gate name: MICFIL(PDM)*/
    kCLOCK_Glikey4 = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 13),        /*!< Clock gate name: GLIKEY_SYSCON1*/
    kCLOCK_Dbg     = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 20),        /*!< Clock gate name: DBG*/
    kCLOCK_Syscon3 = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 21),        /*!< Clock gate name: SYSCON_SENSE0*/
    kCLOCK_Iopctl1 = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 22),        /*!< Clock gate name: IOMUXC_VDD1*/
    kCLOCK_Glikey1 = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 23),        /*!< Clock gate name: GLIKEY1*/
    kCLOCK_LPI2c15 = CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 24),        /*!< Clock gate name: LPI2C*/
    kCLOCK_MediaAccessRamArbiter1 =
        CLK_GATE_DEFINE(CLK_CTL3_PSCCTL0, 25),                     /*!< Clock gate name: MEDIA_ACCESS_RAM_ARBITER1*/
    kCLOCK_Axi0        = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 0),     /*!< Clock gate name: AXI0*/
    kCLOCK_Gpu         = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 2),     /*!< Clock gate name: VGPU*/
    kCLOCK_MipiDsiCtrl = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 4),     /*!< Clock gate name: MIPIDSI*/
    kCLOCK_LPSpi16     = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 5),     /*!< Clock gate name: LPSPI16*/
    kCLOCK_LPSpi14     = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 6),     /*!< Clock gate name: LPSPI14*/
    kCLOCK_Xspi2       = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 8),     /*!< Clock gate name: XSPI2*/
    kCLOCK_Mmu2        = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 11),    /*!< Clock gate name: MMU2*/
    kCLOCK_Glikey5     = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 13),    /*!< Clock gate name: GLIKEY_SYSCON2*/
    kCLOCK_Flexio      = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 15),    /*!< Clock gate name: FLEXIO0*/
    kCLOCK_Lcdif       = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 22),    /*!< Clock gate name: LCDIF(DCN)*/
    kCLOCK_Syscon4     = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 23),    /*!< Clock gate name: SYSCONMEDIA*/
    kCLOCK_JpgDecoder  = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 24),    /*!< Clock gate name: JPG_DECODER*/
    kCLOCK_PngDecoder  = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 25),    /*!< Clock gate name: PNG_DECODER*/
    kCLOCK_Ezhv        = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 26),    /*!< Clock gate name: EZHV*/
    kCLOCK_AxbsEzh     = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 28),    /*!< Clock gate name: AXBS_EZH*/
    kCLOCK_Glikey2     = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL0, 29),    /*!< Clock gate name: GLIKEY2*/
    kCLOCK_Usb0        = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL1, 0),     /*!< Clock gate name: USB0*/
    kCLOCK_Usb1        = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL1, 2),     /*!< Clock gate name: USB1*/
    kCLOCK_Usdhc0      = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL1, 4),     /*!< Clock gate name: USHDC0*/
    kCLOCK_Usdhc1      = CLK_GATE_DEFINE(CLK_CTL4_PSCCTL1, 5),     /*!< Clock gate name: USDHC1*/

/* Control bits in SYSCON. */
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    kCLOCK_Gdet0Ref = CLK_GATE_DEFINE(SYSCON0_SEC_CLK_CTRL, 0),          /*!< Clock gate name: GDET0 Reference clock*/
    kCLOCK_Gdet1Ref = CLK_GATE_DEFINE(SYSCON0_SEC_CLK_CTRL, 1),          /*!< Clock gate name: GDET1 Reference clock*/
    kCLOCK_TrngRef  = CLK_GATE_DEFINE(SYSCON0_SEC_CLK_CTRL, 2),          /*!< Clock gate name: TRNG Reference clock*/
    kCLOCK_Els      = CLK_GATE_DEFINE(SYSCON0_SEC_CLK_CTRL, 3),          /*!< Clock gate name: ELS clock*/
    kCLOCK_ItrcRef  = CLK_GATE_DEFINE(SYSCON0_SEC_CLK_CTRL, 4),          /*!< Clock gate name: ITRC Reference clock*/

    kCLOCK_Gdet0 = CLK_GATE_DEFINE(CLKCTL0_ONE_SRC_CLKSLICE_ENABLE, 0U), /*!< Clock gate name: GDET0. */
    kCLOCK_Gdet1 = CLK_GATE_DEFINE(CLKCTL0_ONE_SRC_CLKSLICE_ENABLE, 1U), /*!< Clock gate name: GDET1. */
#endif
    kCLOCK_Gdet2Ref = CLK_GATE_DEFINE(SYSCON3_SEC_CLK_CTRL, 0),          /*!< Clock gate name: GDET2 Reference clock*/
    kCLOCK_Gdet3Ref = CLK_GATE_DEFINE(SYSCON3_SEC_CLK_CTRL, 1),          /*!< Clock gate name: GDET3 Reference clock*/

    kCLOCK_Rtc       = CLK_GATE_DEFINE(CLKCTL3_ONE_SRC_CLKSLICE_ENABLE, 0U), /*!< RTC functional clock gating. */
    kCLOCK_Gdet2     = CLK_GATE_DEFINE(CLKCTL3_ONE_SRC_CLKSLICE_ENABLE, 1U), /*!< GDET2 functional clock gating. */
    kCLOCK_Gdet3     = CLK_GATE_DEFINE(CLKCTL3_ONE_SRC_CLKSLICE_ENABLE, 2U), /*!< GDET3 functional clock gating. */
    kCLOCK_UsbphyRef = CLK_GATE_DEFINE(CLKCTL4_ONE_SRC_CLKSLICE_ENABLE, 0U), /*!< USBPHY referrence clock gating. */
} clock_ip_name_t;

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_CoreSysClk,      /*!< Core clock  (aka system clock)                                 */
    kCLOCK_BusClk,          /*!< Bus clock (AHB/APB clock, aka HCLK)                    */
    kCLOCK_MclkClk,         /*!< MCLK, to MCLK pin                                      */
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    kCLOCK_Vdd2ClockOutClk, /*!< VDD2 CLOCKOUT                                               */
    kCLOCK_Xspi0Clk,        /*!< XSPI0                                               */
    kCLOCK_Xspi1Clk,        /*!< XSPI1                                               */
    kCLOCK_Wdt0Clk,         /*!< Watchdog0                                              */
    kCLOCK_Wdt1Clk,         /*!< Watchdog1                                              */
    kCLOCK_Hifi4CpuClk,     /*!< Hifi4 DSP  clock                                             */
    kCLOCK_LPFlexComm0Clk,  /*!< Flexcomm0Clock                                         */
    kCLOCK_LPFlexComm1Clk,  /*!< Flexcomm1Clock                                         */
    kCLOCK_LPFlexComm2Clk,  /*!< Flexcomm2Clock                                         */
    kCLOCK_LPFlexComm3Clk,  /*!< Flexcomm3Clock                                         */
    kCLOCK_LPFlexComm4Clk,  /*!< Flexcomm4Clock                                         */
    kCLOCK_LPFlexComm5Clk,  /*!< Flexcomm5Clock                                         */
    kCLOCK_LPFlexComm6Clk,  /*!< Flexcomm6Clock                                         */
    kCLOCK_LPFlexComm7Clk,  /*!< Flexcomm7Clock                                         */
    kCLOCK_LPFlexComm8Clk,  /*!< Flexcomm8Clock                                         */
    kCLOCK_LPFlexComm9Clk,  /*!< Flexcomm9Clock                                         */
    kCLOCK_LPFlexComm10Clk, /*!< Flexcomm10Clock                                        */
    kCLOCK_LPFlexComm11Clk, /*!< Flexcomm11Clock                                        */
    kCLOCK_LPFlexComm12Clk, /*!< Flexcomm12Clock                                        */
    kCLOCK_LPFlexComm13Clk, /*!< Flexcomm13Clock                                        */
#else
    kCLOCK_Wdt2Clk,         /*!< Watchdog1                                              */
    kCLOCK_Wdt3Clk,         /*!< Watchdog1                                              */
    kCLOCK_Hifi1CpuClk,     /*!< Hifi1 DSP  clock                                             */
    kCLOCK_LPFlexComm17Clk, /*!< Flexcomm17Clock                                        */
    kCLOCK_LPFlexComm18Clk, /*!< Flexcomm18Clock                                        */
    kCLOCK_LPFlexComm19Clk, /*!< Flexcomm19Clock                                        */
    kCLOCK_LPFlexComm20Clk, /*!< Flexcomm20Clock                                        */
#endif
    kCLOCK_Vdd1ClockOutClk,  /*!< VDD1 CLOCKOUT                                               */
    kCLOCK_AdcClk,           /*!< ADC                                                    */
    kCLOCK_Xspi2Clk,         /*!< XSPI1                                               */
    kCLOCK_SctClk,           /*!< SCT                                                    */
    kCLOCK_SystickClk,       /*!< Systick                                                */
    kCLOCK_Sdio0Clk,         /*!< SDIO0                                                  */
    kCLOCK_Sdio1Clk,         /*!< SDIO1                                                  */
    kCLOCK_I3cClk,           /*!< I3C                                          */
    kCLOCK_Usb0Clk,          /*!< USB0                                          */
    kCLOCK_Usb1Clk,          /*!< USB1                                          */
    kCLOCK_PdmClk,           /*!< Digital Mic clock                                      */
    kCLOCK_AcmpClk,          /*!< Acmp clock                                             */
    kCLOCK_FlexioClk,        /*!< FlexIO                                                 */
    kCLOCK_LPSpi14Clk,       /*!< LPSPI14                                                 */
    kCLOCK_LPI2c15Clk,       /*!< LPI2C15                                                 */
    kCLOCK_LPSpi16Clk,       /*!< LPSPI16                                                 */
    kCLOCK_VgpuClk,          /*!< VGPU Core                                               */
    kCLOCK_LcdifClk,         /*!< LCDIF Clock                                     */
    kCLOCK_MipiDphyClk,      /*!< MIPI D-PHY Bit Clock                                   */
    kCLOCK_MipiDphyEscRxClk, /*!< MIPI D-PHY RX Clock                                    */
    kCLOCK_MipiDphyEscTxClk, /*!< MIPI D-PHY TX Clock                                    */
} clock_name_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide
 *  starting from LSB upwards
 *
 *  [    31-29                14             12:11         10:0    ]
   [CLKCTL index]: [Disable MUX output]: [MUXA choice]:[MUXA offset]. MUX offset 0 means end of
 descriptor.
 */
#define CLK_MUX_INST_INDEX_SHIFT    29U
#define CLK_MUX_CHOICE_OFFSET_SHIFT 11U
#define CLK_MUX_DISABLE_OUTPUT_MASK (1UL << 14U)

