nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.h
    kMEDIA_VDD2_BASE_to_LCDIF =
        CLKCTL4_TUPLE_MUXA(LCDIFPIXELCLKSEL_OFFSET, 0), /*!< Attach MEDIA VDD2 base clock to LCDIF. */
    kMAIN_PLL_PFD2_to_LCDIF =
        CLKCTL4_TUPLE_MUXA(LCDIFPIXELCLKSEL_OFFSET, 1), /*!< Attach Main PLL PFD0 clock to LCDIF. */
    kFRO0_DIV1_to_LCDIF      = CLKCTL4_TUPLE_MUXA(LCDIFPIXELCLKSEL_OFFSET, 2), /*!< Attach FRO0 max clock to LCDIF. */
    kAUDIO_PLL_PFD1_to_LCDIF = CLKCTL4_TUPLE_MUXA(LCDIFPIXELCLKSEL_OFFSET, 3), /*!< Attach Audio PLL PFD1 to LCDIF. */
    kNONE_to_LCDIF           = CLKCTL4_TUPLE_MUXA_NONE(LCDIFPIXELCLKSEL_OFFSET, 0), /*!< Attach NONE to LCDIF. */
} clock_attach_id_t;

/*! @brief Clock dividers */
typedef enum _clock_div_name
{
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    kCLOCK_DivCmptMainClk   = CLKCTL0_TUPLE_MUXA(CMPTMAINCLKDIV_OFFSET, 0), /*!< VDD2_COMP Main clock Divider. */
    kCLOCK_DivDspClk        = CLKCTL0_TUPLE_MUXA(DSPCPUCLKDIV_OFFSET, 0),   /*!< DSP CPU Clk Divider. */
    kCLOCK_DivComputeRamClk = CLKCTL0_TUPLE_MUXA(RAMCLKDIV_OFFSET, 0),      /*!< RAM Clk Divider. */
    kCLOCK_DivTpiuClk       = CLKCTL0_TUPLE_MUXA(TPIUCLKDIV_OFFSET, 0),     /*!< TIPU Clk Divider. */
    kCLOCK_DivXspi0Clk      = CLKCTL0_TUPLE_MUXA(XSPI0FCLKDIV_OFFSET, 0),   /*!< XSPI0 Clk Divider. */
    kCLOCK_DivXspi1Clk      = CLKCTL0_TUPLE_MUXA(XSPI1FCLKDIV_OFFSET, 0),   /*!< XSPI1 Clk Divider. */
    kCLOCK_DivSctClk        = CLKCTL0_TUPLE_MUXA(SCTFCLKDIV_OFFSET, 0),     /*!< SCT functional Clk Divider. */
    kCLOCK_DivUtick0Clk     = CLKCTL0_TUPLE_MUXA(UTICK0CLKDIV_OFFSET, 0),   /*!< UTICK0 Clk Divider. */
    kCLOCK_DivSystickClk    = CLKCTL0_TUPLE_MUXA(SYSTICKFCLKDIV_OFFSET, 0), /*!< SYSTICK Clk Divider. */
    kCLOCK_DivSai012Clk     = CLKCTL0_TUPLE_MUXA(SAI012CLKDIV_OFFSET, 0),   /*!< SAI0, SAI1 and SAI2 Clk Divider. */
    kCLOCK_DivTrngClk       = CLKCTL0_TUPLE_MUXA(TRNGFCLKDIV_OFFSET, 0),    /*!< TRNG Clk Divider. */
    kCLOCK_DivI3c01PClk     = CLKCTL0_TUPLE_MUXA(I3C01PCLKDIV_OFFSET, 0),   /*!< I3C01 P-Clk Divider. */
    kCLOCK_DivI3c01Clk      = CLKCTL0_TUPLE_MUXA(I3C01FCLKDIV_OFFSET, 0),   /*!< I3C01 functional Clk Divider. */
    kCLOCK_DivClockOut      = CLKCTL0_TUPLE_MUXA(CLKOUTCLKDIV_OFFSET, 0),   /*!< CLKOUT Divider. */
    kCLOCK_DivFcclk0Clk     = CLKCTL0_TUPLE_MUXA(FCCLK0DIV_OFFSET, 0),      /*!< FCCLK0 Clk Divider. */
    kCLOCK_DivFcclk1Clk     = CLKCTL0_TUPLE_MUXA(FCCLK1DIV_OFFSET, 0),      /*!< FCCLK1 Clk Divider. */
    kCLOCK_DivFcclk2Clk     = CLKCTL0_TUPLE_MUXA(FCCLK2DIV_OFFSET, 0),      /*!< FCCLK2 Clk Divider. */
    kCLOCK_DivFcclk3Clk     = CLKCTL0_TUPLE_MUXA(FCCLK3DIV_OFFSET, 0),      /*!< FCCLK3 Clk Divider. */
    kCLOCK_DivCtimer0Clk    = CLKCTL0_TUPLE_MUXA(CTIMER0CLKDIV_OFFSET, 0),  /*!< CTimer0 Clk Divider. */
    kCLOCK_DivCtimer1Clk    = CLKCTL0_TUPLE_MUXA(CTIMER1CLKDIV_OFFSET, 0),  /*!< CTimer1 Clk Divider. */
    kCLOCK_DivCtimer2Clk    = CLKCTL0_TUPLE_MUXA(CTIMER2CLKDIV_OFFSET, 0),  /*!< CTimer2 Clk Divider. */
    kCLOCK_DivCtimer3Clk    = CLKCTL0_TUPLE_MUXA(CTIMER3CLKDIV_OFFSET, 0),  /*!< CTimer3 Clk Divider. */
    kCLOCK_DivCtimer4Clk    = CLKCTL0_TUPLE_MUXA(CTIMER4CLKDIV_OFFSET, 0),  /*!< CTimer4 Clk Divider. */
#else
    kCLOCK_DivLPFlexComm17Clk = CLKCTL1_TUPLE_MUXA(FC17FCLKDIV_OFFSET, 0),       /*!< LP_FLEXCOMM17 Clk Divider. */
    kCLOCK_DivLPFlexComm18Clk = CLKCTL1_TUPLE_MUXA(FC18FCLKDIV_OFFSET, 0),       /*!< LP_FLEXCOMM18 Clk Divider. */
    kCLOCK_DivLPFlexComm19Clk = CLKCTL1_TUPLE_MUXA(FC19FCLKDIV_OFFSET, 0),       /*!< LP_FLEXCOMM19 Clk Divider. */
    kCLOCK_DivLPFlexComm20Clk = CLKCTL1_TUPLE_MUXA(FC20FCLKDIV_OFFSET, 0),       /*!< LP_FLEXCOMM20 Clk Divider. */
    kCLOCK_DivSenseDspClk     = CLKCTL1_TUPLE_MUXA(SENSEDSPCPUCLKDIV_OFFSET, 0), /*!< Sense DSP Clk Divider. */
    kCLOCK_DivSai3Clk         = CLKCTL1_TUPLE_MUXA(SAI3CLKDIV_OFFSET, 0),        /*!< SAI3 FCLK Clk Divider. */
    kCLOCK_DivUtick1Clk       = CLKCTL1_TUPLE_MUXA(UTICK1CLKDIV_OFFSET, 0),      /*!< UTICK1 Functional Clk Divider. */
    kCLOCK_DivSystickClk      = CLKCTL1_TUPLE_MUXA(SYSTICKFCLKDIV_OFFSET, 0),    /*!< SYSTICK Functional Clk Divider. */
    kCLOCK_DivCtimer5Clk      = CLKCTL1_TUPLE_MUXA(CTIMER5CLKDIV_OFFSET, 0),     /*!< CTIMER5 FCLK Clk Divider. */
    kCLOCK_DivCtimer6Clk      = CLKCTL1_TUPLE_MUXA(CTIMER6CLKDIV_OFFSET, 0),     /*!< CTIMER6 FCLK Clk Divider. */
    kCLOCK_DivCtimer7Clk      = CLKCTL1_TUPLE_MUXA(CTIMER7CLKDIV_OFFSET, 0),     /*!< CTIMER7 FCLK Clk Divider. */
    kCLOCK_DivI3c23Clk = CLKCTL1_TUPLE_MUXA(I3C23FCLKDIV_OFFSET, 0), /*!< I3C2 and I3C3 Functional Clk Divider. */
#endif
    kCLOCK_DivCommonVddnClk = CLKCTL2_TUPLE_MUXA(COMMONVDDNCLKDIV_OFFSET, 0),   /*!< Common VDDN Clk Divider. */
    kCLOCK_DivSenseMainClk  = CLKCTL3_TUPLE_MUXA(SENSEMAINCLKDIV_OFFSET, 0),    /*!< VDD1_SENSE Main Clock Divider. */
    kCLOCK_DivSenseRamClk   = CLKCTL3_TUPLE_MUXA(SENSERAMCLKDIV_OFFSET, 0),     /*!< Senese RAM Clk Divider. */
    kCLOCK_DivOstimerClk    = CLKCTL3_TUPLE_MUXA(OSEVENTFCLKDIV_OFFSET, 0),     /*!< OSTIMER Clk Divider. */
    kCLOCK_DivSdadcClk      = CLKCTL3_TUPLE_MUXA(SDADCFCLKDIV_OFFSET, 0),       /*!< SDADC Clk Divider. */
    kCLOCK_DivAdcClk        = CLKCTL3_TUPLE_MUXA(SARADCFCLKDIV_OFFSET, 0),      /*!< SARADC Clk Divider. */
    kCLOCK_Div32KhzWakeClk  = CLKCTL3_TUPLE_MUXA(A32KHZWAKECLKDIV_OFFSET, 0),   /*!< 32KHZ Wakeup Clk Divider. */
    kCLOCK_DivMicfil0Clk    = CLKCTL3_TUPLE_MUXA(MICFIL0FCLKDIV_OFFSET, 0),     /*!< DMIC0 Clk Divider. */
    kCLOCK_DivLpi2c15Clk    = CLKCTL3_TUPLE_MUXA(LPI2CFCLKDIV_OFFSET, 0),       /*!< PMIC LPI2C Clk Divider. */
    kCLOCK_DivVdd1ClockOut  = CLKCTL3_TUPLE_MUXA(SENSE_CLKOUTCLKDIV_OFFSET, 0), /*!< CLKOUT_VDD1 Clk Divider. */

    kCLOCK_DivMediaVddnClk = CLKCTL4_TUPLE_MUXA(MEDIAVDDNCLKDIV_OFFSET, 0),     /*!< Media VDDN Clk Divider. */
    kCLOCK_DivMediaMainClk = CLKCTL4_TUPLE_MUXA(MEDIAMAINCLKDIV_OFFSET, 0),     /*!< Media Main Clk Divider. */
    kCLOCK_DivXspi2Clk     = CLKCTL4_TUPLE_MUXA(XSPI2FCLKDIV_OFFSET, 0),        /*!< XSPI2 Clk Divider. */
    kCLOCK_DivSdio0Clk     = CLKCTL4_TUPLE_MUXA(SDIO0FCLKDIV_OFFSET, 0),        /*!< SDIO0 Clk Divider. */
    kCLOCK_DivSdio1Clk     = CLKCTL4_TUPLE_MUXA(SDIO1FCLKDIV_OFFSET, 0),        /*!< SDIO1 Clk Divider. */
    kCLOCK_DivDphyClk      = CLKCTL4_TUPLE_MUXA(DPHYCLKDIV_OFFSET, 0),          /*!< DPHY Clk Divider. */
    kCLOCK_DivDphyEscRxClk = CLKCTL4_TUPLE_MUXA(DPHYESCRXCLKDIV_OFFSET, 0),     /*!< DphyEscRx Clk Divider. */
    kCLOCK_DivDphyEscTxClk = CLKCTL4_TUPLE_MUXA(DPHYESCTXCLKDIV_OFFSET, 0),     /*!< DphyEscTx Clk Divider. */
    kCLOCK_DivVgpuClk      = CLKCTL4_TUPLE_MUXA(VGPUCLKDIV_OFFSET, 0),          /*!< VGPU Clk Divider. */
    kCLOCK_DivLpspi14Clk   = CLKCTL4_TUPLE_MUXA(LPSPI14CLKDIV_OFFSET, 0),       /*!< LPSPI14 Clk Divider. */
    kCLOCK_DivLpspi16Clk   = CLKCTL4_TUPLE_MUXA(LPSPI16CLKDIV_OFFSET, 0),       /*!< LPSPI16 Clk Divider. */
    kCLOCK_DivFlexioClk    = CLKCTL4_TUPLE_MUXA(FLEXIOCLKDIV_OFFSET, 0),        /*!< FLEXIO Clk Divider. */
    kCLOCK_DivLcdifClk     = CLKCTL4_TUPLE_MUXA(LCDIFPIXELCLKDIV_OFFSET, 0),    /*!< LCDIF Pixel Clk Divider. */
    kCLOCK_DivLowFreqClk   = CLKCTL4_TUPLE_MUXA(LOWFREQCLKDIV_OFFSET, 0),       /*!< Low frequency Clk Divider. */
} clock_div_name_t;

