nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
 * @brief Enable the clock for specific IP.
 * @param clk : Clock to be enabled.
 * @return  Nothing
 */
void CLOCK_EnableClock(clock_ip_name_t clk);

/**
 * @brief Disable the clock for specific IP.
 * @param clk : Clock to be disabled.
 * @return  Nothing
 */
void CLOCK_DisableClock(clock_ip_name_t clk);

/**
 * brief   Configure the clock selection muxes.
 *
 * For some of the muxes, there's SEL_EN bit to gate the mux ouput to reduce power, using kNONT_to_XXX to gate the mux
 * oupput. used by any peripheral.
 * @param   connection  : Clock to be configured.
 * @return  Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection);

/**
 * @brief   Setup peripheral clock dividers.
 * @param   div_name    : Clock divider name
 * @param   divider     : Value to be divided. Divided clock frequency =
 * Undivided clock frequency / divider.
 * @return  Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divider);

/*! @brief  Return Frequency of selected clock
 *  @return Frequency of selected clock
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName);

#if defined(FSL_CLOCK_DRIVER_COMPUTE) /* Compute domain specific APIs */

/*! @brief  Return clock frequency of LP_FLEXCOMM 0 to 13 Clock Source FCCLK
 *  @param  id : index of FCCLK
 *  @return Frequency of FCCLK
 */
uint32_t CLOCK_GetFCClkFreq(uint32_t id);

/*! @brief  Return Frequency of compute main clk
 *  @return Frequency of main clk
 */
uint32_t CLOCK_GetComputeMainClkFreq(void);

/*! @brief  Return Frequency of compute audio clk
 *  @return Frequency of audio_clk_cmpt
 */
uint32_t CLOCK_GetComputeAudioClkFreq(void);

/*! @brief  Return Frequency of Compute DSP clk
 *  @return Frequency of DSP clk
 */
uint32_t CLOCK_GetHifi4ClkFreq(void);

/*! @brief  Return Frequency of Compute Base clock
 *  @return Frequency of compute base clk
 */
uint32_t CLOCK_GetComputeBaseClkFreq(void);

/*! @brief  Return Frequency of Compute DSP Base clock
 *  @return Frequency of compute dsp base clk
 */
uint32_t CLOCK_GetComputeDspBaseClkFreq(void);

/*! @brief  Return Frequency of VDD2_COM Base Clock
 *  @return Frequency of baseclk_com2
 */
uint32_t CLOCK_GetVdd2ComBaseClkFreq(void);

/*! @brief  Enable/Disable FRO0 clock for various domains.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * DRFO0 max clock for certain domain.
 */
void CLOCK_EnableFro0ClkForDomain(uint32_t domainEnable);

/*! @brief  Return Frequency of sct
 *  @return Frequency of sct clk
 */
uint32_t CLOCK_GetSctClkFreq(void);

/*! @brief Set the Sense AUDIO clock frequency based on the setting from Sense Domain.
 *
 * This API is used to tell the driver of compute domain about the clcok frequency of sense base clock.
 * @param freq : The sense base clock frequency in Hz.
 */
static inline void CLOCK_SetSenseAudioClkFreq(uint32_t freq)
{
    g_senseAudioClkFreq = freq;
}

/*! @brief  Return Frequency of VDD1 audio clk.
 * NOTE, when called from Compute Domain, need to use CLOCK_SetSenseAudioClkFreq to tell the clock driver the audio_clk
 * frequency before the API is called.
 *  @return Frequency of audio_clk
 */
uint32_t CLOCK_GetSenseAudioClkFreq(void);

/*! @brief  Return Frequency of TPIU clk
 *  @return Frequency of SAI clk
 */
uint32_t CLOCK_GetTpiuClkFreq(void);

/*! @brief  Return Frequency of TRNG clk
 *  @return Frequency of SAI clk
 */
uint32_t CLOCK_GetTrngClkFreq(void);

#else  /* Sense domain specific APIs */

/*! @brief  Return Frequency of VDD1 audio clk
 *  @return Frequency of audio_clk
 */
uint32_t CLOCK_GetSenseAudioClkFreq(void);

/*! @brief  Return Frequency of Sense DSP clk
 *  @return Frequency of Sense DSP clk
 */
uint32_t CLOCK_GetHifi1ClkFreq(void);

#endif /* FSL_CLOCK_DRIVER_COMPUTE */

/*! @brief  Enable/Disable FRO clock output.
 *  @param  base : base address of FRO.
 *  @param  divOutEnable : Or'ed value of #clock_fro_output_en_t to enable certain clock freq output.
 */
void CLOCK_EnableFroClkOutput(FRO_Type *base, uint32_t divOutEnable);

/*! @brief  Configure FRO trim values when FRO is configured in Open loop mode.
 *  @param  base : base address of FRO.
 *  @param  trimVal : 12bits trim value.
 */
void CLOCK_ConfigFroTrim(FRO_Type *base, uint16_t trimVal);

/*! @brief  Disable the FRO clock. This API will disable the FRO clock output and power off FRO.
 *  @param  base : base address of FRO.
 */
void CLOCK_DisableFro(FRO_Type *base);

/*! @brief  Enable/Disable FRO for close loop mode(autotuner).
 *  @param  base : base address of FRO.
 *  @param  config : The configuration for FRO.
 *  @param  enable: Enable auto tuning mode or not.
 *  @retval kStatus_Success successfully tuned to the target configuration.
 *  @retval kStatus_InvalidArgument Invalid arguement.
 *  @retval kStatus_Fail failed to lock to the target frequency.
 */
status_t CLOCK_EnableFroAutoTuning(FRO_Type *base, const clock_fro_config_t *config, bool enable);

/*! @brief  Enable FRO clock output with specified frequency.
 *  @param  base : base address of FRO.
 *  @param  targetFreq target fro frequency.
 *  @param  divOutEnable Or'ed value of #clock_fro_output_en_t to enable certain clock freq output.
 */
void CLOCK_EnableFroClkFreq(FRO_Type *base, uint32_t targetFreq, uint32_t divOutEnable);

/*! @brief  Enable FRO clock output with target frequency using FRO close loop mode.
 * For example, to enable FRO2 to ouput 200MHZ:
 * @code
 *     const clock_fro_config_t config = {
 *      .targetFreq = 200000000U,
 *      .range = 50U,
 *      .trim1DelayUs = 15U,
 *      .trim2DelayUs = 150U,
 *      .refDiv = 0U,
 *      .enableInt = 0U,
 *      .coarseTrimEn = true,
 *  };
 *  CLOCK_EnableFroClkFreqCloseLoop(FRO2, &config, kCLOCK_FroAllOutEn);
 * @endcode
 *  @param  base : base address of FRO.
 *  @param  config : The configuration for FRO.
 *  @param  divOutEnable : Or'ed value of clock_fro_output_en_t to enable certain clock freq output.
 *  @retval kStatus_Success successfully tuned to the target configuration.
 *  @retval kStatus_InvalidArgument Invalid arguement.
 *  @retval kStatus_Fail failed to lock to the target frequency.
 */
status_t CLOCK_EnableFroClkFreqCloseLoop(FRO_Type *base, const clock_fro_config_t *config, uint32_t divOutEnable);

/*! @brief  Get FRO flags.
 *  @param  base : base address of FRO.
 *  @param  flags Or'ed value of #_clock_fro_flag.
 */
uint32_t CLOCK_GetFroFlags(FRO_Type *base);

/*! @brief  Clear FRO flags.
 *  @param  base : base address of FRO.
 *  @param  flags Or'ed value of #_clock_fro_flag to clear.
 */
inline static void CLOCK_ClearFroFlags(FRO_Type *base, uint32_t flags)
{
    base->CSR.CLR = flags;
}

/*! @brief  Return Frequency of FRO clk
 *  @param id FRO index
 *  @return Frequency of FRO clk
 */
uint32_t CLOCK_GetFroClkFreq(uint32_t id);

/*! @brief  Return Frequency of sense main clk
 *  @return Frequency of main clk
 */
uint32_t CLOCK_GetSenseMainClkFreq(void);

/*! @brief  Return Frequency of MAINPLL
 *  @return Frequency of MAINPLL
 */
uint32_t CLOCK_GetMainPllFreq(void);

/*! @brief  Get current output frequency of specific Main PLL PFD.
 *  @param   pfd    : pfd name to get frequency.
 *  @return  Frequency of MainPLL PFD.
 */
uint32_t CLOCK_GetMainPfdFreq(clock_pfd_t pfd);

/*! @brief  Return Frequency of AUDIO PLL
 *  @return Frequency of AUDIO PLL
 */
uint32_t CLOCK_GetAudioPllFreq(void);

/*! @brief  Get current output frequency of specific Audio PLL PFD.
 *  @param   pfd    : pfd name to get frequency.
 *  @return  Frequency of AUDIO PLL PFD.
 */

