nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.h
uint32_t CLOCK_GetAudioPfdFreq(clock_pfd_t pfd);
/*! @brief  Return Frequency of High-Freq output of FRO
 *  @return Frequency of High-Freq output of FRO
 */

/*! @brief  Return Frequency of sys osc Clock
 *  @return Frequency of sys osc Clock. Or CLK_IN pin frequency.
 */
static inline uint32_t CLOCK_GetXtalInClkFreq(void)
{
    return ((g_xtalFreq != 0U) ? g_xtalFreq : g_clkinFreq);
}

/*! @brief  Return Frequency of Sense Base clock
 *  @return Frequency of sense base clk
 */
uint32_t CLOCK_GetSenseBaseClkFreq(void);

/*! @brief  Enable/Disable sys osc clock from external crystal clock.
 *  @param  enable : true to enable system osc clock, false to bypass system
 * osc.
 *  @param  enableLowPower : true to enable low power mode, false to enable high
 * gain mode.
 *  @param  delay_us : Delay time after OSC power up.
 */
void CLOCK_EnableSysOscClk(bool enable, bool enableLowPower, uint32_t delay_us);

/*! @brief  Return Frequency of VDDN_COM Base Clock
 *  @return Frequency of baseclk_comn
 */
uint32_t CLOCK_GetVddnComBaseClkFreq(void);

/*! @brief  Return Frequency of VDDN_MEDIA Base Clock
 *  @return Frequency of baseclk_mdn
 */
uint32_t CLOCK_GetVddnMediaBaseClkFreq(void);

/*! @brief  Return Frequency of VDD2_MEDIA Base Clock
 *  @return Frequency of baseclk_md2
 */
uint32_t CLOCK_GetVdd2MediaBaseClkFreq(void);

/*! @brief  Return Frequency of MEDIA_MAIN Clock
 *  @return Frequency of media_main_clk
 */
uint32_t CLOCK_GetMediaMainClkFreq(void);

/*! @brief  Return Frequency of MEDIA_VDDN Clock
 *  @return Frequency of media_vddn_clk
 */
uint32_t CLOCK_GetMediaVddnClkFreq(void);

/*! @brief  Enable/Disable FRO2 clock for various domains.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * DRFO2 max clock for certain domain.
 */
void CLOCK_EnableFro2ClkForDomain(uint32_t domainEnable);

/*! @brief  Enable/Disable MainPLL PFD clock for various domains.
 *
 * Enables PFD clock of MainPLL for various domains. Each PFD clock of MainPLL can be sent to various domain. To reduce
 * power consumption, turn off the PFD in the domain when this PFD is not configured.
 *  @param pfd  : Which PFD clock to control.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * clock for certain domain.
 */
void CLOCK_EnableMainPllPfdClkForDomain(clock_pfd_t pfd, uint32_t domainEnable);

/*! @brief  Enable/Disable AUDIO PFD clock for various domains.
 *
 * Enables PFD clock of AUDIO for various domains. Each PFD clock of AUDIO can be sent to various domain. To reduce
 * power consumption, turn off the PFD in the domain when this PFD is not configured.
 *  @param pfd  : Which PFD clock to control.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * clock for certain domain.
 */
void CLOCK_EnableAudioPllPfdClkForDomain(clock_pfd_t pfd, uint32_t domainEnable);

/*! @brief  Enable/Disable AUDIO VCO clock for various domains.
 *
 * VCO clock of Audio PLL can be sent to various domains to reduce power consumption when VCO is not set to use in such
 * domain. This VCO can be disabled for such domain.
 *  @param  domainEnable : Or'ed value of #clock_domain_enable_t to enable
 * clock for certain domain.
 */
void CLOCK_EnableAudioPllVcoClkForDomain(uint32_t domainEnable);

/*! @brief  Initialize the Main PLL.
 *  @param  config    : Configuration to set to PLL.
 */
void CLOCK_InitMainPll(const clock_main_pll_config_t *config);

/*! brief  Deinit the Main PLL.
 *  param  none.
 */
static inline void CLOCK_DeinitMainPll(void)
{
    /* Set Main PLL Reset & HOLDRING_OFF_ENA */
    CLKCTL2->MAINPLL0CTL0 |= CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_MASK | CLKCTL2_MAINPLL0CTL0_RESET_MASK;
    /* Power down Main PLL*/
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    SLEEPCON0->RUNCFG_SET = SLEEPCON0_RUNCFG_PLLLDO_PD_MASK | SLEEPCON0_RUNCFG_PLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_PLLLDO_PD_MASK | SLEEPCON1_RUNCFG_PLLANA_PD_MASK;
#endif
}
/*! @brief Initialize the Main PLL PFD.
 *  @param pfd    : Which PFD clock to enable.
 *  @param divider    : The PFD divider value.
 *  @note It is recommended that PFD settings are kept between 12-35.
 */
void CLOCK_InitMainPfd(clock_pfd_t pfd, uint8_t divider);

/*! brief Disable the Main PLL PFD.
 *  param pfd    : Which PFD clock to disable.
 */
static inline void CLOCK_DeinitMainPfd(clock_pfd_t pfd)
{
    CLKCTL2->MAINPLL0PFD |= ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKGATE_MASK << (8UL * (uint32_t)pfd));
}

/*! @brief  Initialize the audio PLL.
 *  @param  config    : Configuration to set to PLL.
 */
void CLOCK_InitAudioPll(const clock_audio_pll_config_t *config);

/*! brief  Deinit the Audio PLL.
 *  param  none.
 */
static inline void CLOCK_DeinitAudioPll(void)
{
    /* Set Audio PLL Reset & HOLDRINGOFF_ENA */
    CLKCTL2->AUDIOPLL0CTL0 |= CLKCTL2_AUDIOPLL0CTL0_HOLD_RING_OFF_ENA_MASK | CLKCTL2_AUDIOPLL0CTL0_RESET_MASK;
    /* Power down Audio PLL */
#if defined(FSL_CLOCK_DRIVER_COMPUTE)
    /* Power down Audio PLL before change fractional settings */
    SLEEPCON0->RUNCFG_SET = SLEEPCON0_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON0_RUNCFG_AUDPLLANA_PD_MASK;
#else
    SLEEPCON1->RUNCFG_SET = SLEEPCON1_RUNCFG_AUDPLLLDO_PD_MASK | SLEEPCON1_RUNCFG_AUDPLLANA_PD_MASK;
#endif
}

/*! @brief Initialize the audio PLL PFD.
 *  @param pfd    : Which PFD clock to enable.
 *  @param divider    : The PFD divider value.
 *  @note It is recommended that PFD settings are kept between 12-35.
 */
void CLOCK_InitAudioPfd(clock_pfd_t pfd, uint8_t divider);
/*! brief Disable the audio PLL PFD.
 *  param pfd    : Which PFD clock to disable.
 */
static inline void CLOCK_DeinitAudioPfd(uint32_t pfd)
{
    CLKCTL2->AUDIOPLL0PFD |= ((uint32_t)CLKCTL2_AUDIOPLL0PFD_PFD0_CLKGATE_MASK << (8UL * (uint32_t)pfd));
}

/*! @brief  Return Frequency of Lower power osc
 *  @return Frequency of LPOSC
 */
static inline uint32_t CLOCK_GetLpOscFreq(void)
{
    return CLK_LPOSC_1MHZ;
}

/*! @brief  Return Frequency of sys osc Clock
 *  @return Frequency of sys osc Clock. Or CLK_IN pin frequency.
 */
static inline uint32_t CLOCK_GetSysOscFreq(void)
{
    return (CLKCTL2->SYSOSCBYPASS == 0U) ? g_xtalFreq : ((CLKCTL2->SYSOSCBYPASS == 1U) ? g_clkinFreq : 0U);
}

/*! @brief  Return Frequency of MCLK Input Clock
 *  @return Frequency of MCLK input Clock.
 */
static inline uint32_t CLOCK_GetMclkInClkFreq(void)
{
    return g_mclkFreq;
}

/*! @brief  Return Frequency of 32kHz osc
 *  @return Frequency of 32kHz osc
 */
uint32_t CLOCK_GetOsc32KFreq(void);

/*! @brief  Enables OSC32KNP
 *  @param  config : configuration set to OSC32KNP
 */
void CLOCK_EnableOsc32K(clock_osc32k_config_t *config);

/*! @brief  Disable OSC32KNP
 */
static inline void CLOCK_DisableOsc32K(void)
{
    OSC32KNP->CTRL |= OSC32KNP_CTRL_OSC_DIS_MASK;
}

/*! @brief  Return Frequency of 32khz wake clk
 *  @return Frequency of 32kHz wake clk
 */
uint32_t CLOCK_GetWakeClk32KFreq(void);

/*!
 * @brief Set the XTALIN (system OSC) frequency based on board setting.
 * NOTE, when SOSC is used, either CLOCK_SetXtalFreq or CLOCK_SetClkinFreq(But NOT both.) should be called to tell
 * driver the clock frequency connected to SOSC module.
 *
 * @param freq : The XTAL input clock frequency in Hz.
 */
static inline void CLOCK_SetXtalFreq(uint32_t freq)
{
    g_xtalFreq  = freq;
    g_clkinFreq = 0U;
}

/*!
 * @brief Set the CLKIN (CLKIN pin) frequency based on board setting.
 *
 * @param freq : The CLK_IN pin input clock frequency in Hz.
 */
static inline void CLOCK_SetClkinFreq(uint32_t freq)
{
    g_clkinFreq = freq;
    g_xtalFreq  = 0U;
}

/*!
 * @brief Set the 32KHz external input frequency based on board setting.
 *
 * @param freq : The 32KHz external pin input clock frequency in Hz.
 */
static inline void CLOCK_Set32kClkinFreq(uint32_t freq)
{
    g_32kClkinFreq = freq;
}

/*!
 * @brief Set the MCLK IN frequency based on board setting.
 *
 * @param freq : The MCLK input clock frequency in Hz.
 */
static inline void CLOCK_SetMclkFreq(uint32_t freq)
{
    g_mclkFreq = freq;
}

