nxp-mcuxpresso/mcux-sdk/devices/MIMXRT735S/drivers/fsl_clock.h
/*! @brief  Return Frequency of Core/system clock
 *  @return Frequency of core or system Clock
 */
static inline uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return CLOCK_GetFreq(kCLOCK_CoreSysClk);
}

/*! @brief  Return Frequency of XSPI function clock
 *  @param  id : XSPI index to get frequency.
 *  @return Frequency of XSPI functional Clock
 */
uint32_t CLOCK_GetXspiClkFreq(uint32_t id);

/*! @brief  Return Frequency of UTICK function clock
 *  @return Frequency of UTICK functional Clock
 */
uint32_t CLOCK_GetUtickClkFreq(void);

/*! @brief  Return Frequency of systick clk
 *  @return Frequency of systick clk
 */
uint32_t CLOCK_GetSystickClkFreq(void);

/*! @brief  Return Frequency of WDT clk
 *  @param  id : WDT index to get frequency.
 *  @return Frequency of WDT clk
 */
uint32_t CLOCK_GetWdtClkFreq(uint32_t id);

/*! @brief  Return Frequency of ACMP clk
 *  @return Frequency of ACMP clk
 */
uint32_t CLOCK_GetAcmpClkFreq(void);

/*! @brief  Return Frequency of SAI clk
 *  @return Frequency of SAI clk
 */
uint32_t CLOCK_GetSaiClkFreq(void);

/*! @brief  Return Frequency of USB clk
 *  @return Frequency of USB clk
 */
uint32_t CLOCK_GetUsbClkFreq(void);

/*! @brief  Return Frequency of I3C clk
 *  @return Frequency of I3C clk
 */
uint32_t CLOCK_GetI3cClkFreq(void);

/*! @brief  Return Frequency of Flexcomm functional Clock
 *  @param  id : flexcomm index to get frequency.
 *  @return Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetLPFlexCommClkFreq(uint32_t id);

/*! @brief  Return Frequency of LPI2C functional Clock
 *  @param  id : LPI2C index to get frequency.
 *  @return Frequency of LPI2C functional Clock
 */
uint32_t CLOCK_GetLPI2cClkFreq(uint32_t id);

/*! @brief  Return Frequency of LPSPI functional Clock
 *  @param  id : LPSPI index to get frequency.
 *  @return Frequency of LPSPI functional Clock
 */
uint32_t CLOCK_GetLPSpiClkFreq(uint32_t id);

/*! @brief  Return Frequency of Flexio functional Clock
 *  @return Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetFlexioClkFreq(void);

/*! @brief  Return Frequency of OSTIMER functional Clock
 *  @return Frequency of OSTIMER functional Clock
 */
uint32_t CLOCK_GetOSTimerClkFreq(void);

/*! @brief  Return Frequency of MICFIL functional Clock
 *  @return Frequency of MICFIL functional Clock
 */
uint32_t CLOCK_GetMicfilClkFreq(void);

/*! @brief  Return Frequency of Ctimer Clock
 *  @param  id : ctimer index to get frequency.
 *  @return Frequency of Ctimer Clock
 */
uint32_t CLOCK_GetCTimerClkFreq(uint32_t id);

/*! @brief  Return Frequency of VDD2 ClockOut
 *  @return Frequency of ClockOut
 */
uint32_t CLOCK_GetClockOutClkFreq(void);

/*! @brief  Return Frequency of VDD1 Clock Out
 *  @return Frequency of ClockOut of sense domain
 */
uint32_t CLOCK_GetVdd1ClockOutClkFreq(void);

/*! @brief  Return Frequency of Adc Clock
 *  @return Frequency of Adc Clock.
 */
uint32_t CLOCK_GetAdcClkFreq(void);

/*! @brief  Return Frequency of SDADC Clock
 *  @return Frequency of SDADC Clock.
 */
uint32_t CLOCK_GetSdAdcClkFreq(void);

/*! @brief  Return Frequency of VGPU functional Clock
 *  @return Frequency of VGPU functional Clock
 */
uint32_t CLOCK_GetVgpuClkFreq(void);

/*! @brief  Return Frequency of LCDIF pixel Clock
 *  @return Frequency of LCDIF pixel Clock
 */
uint32_t CLOCK_GetLcdifClkFreq(void);

/*! @brief  Return Frequency of MIPI DPHY functional Clock
 *  @return Frequency of MIPI DPHY functional Clock
 */
uint32_t CLOCK_GetMipiDphyClkFreq(void);

/*! @brief  Return Frequency of MIPI DPHY Esc RX functional Clock
 *  @return Frequency of MIPI DPHY Esc RX functional Clock
 */
uint32_t CLOCK_GetMipiDphyEscRxClkFreq(void);

/*! @brief  Return Frequency of MIPI DPHY Esc Tx functional Clock
 *  @return Frequency of MIPI DPHY Esc Tx functional Clock
 */
uint32_t CLOCK_GetMipiDphyEscTxClkFreq(void);

/*! @brief  Return Frequency of USDHC Clock
 *  @param  id : uSDHC index to get frequency.
 *  @return Frequency of USDHC Clock
 */
uint32_t CLOCK_GetUsdhcClkFreq(uint32_t id);

/*! brief Enable USB HS PHY PLL clock.
 *
 * This function enables the internal 480MHz USB PHY PLL clock.
 *
 * param src  USB HS PHY PLL clock source.
 * param freq The frequency specified by src.
 * retval true The clock is set successfully.
 * retval false The clock source is invalid to get proper USB HS clock.
 */
bool CLOCK_EnableUsbhs0PhyPllClock(clock_usb_phy_src_t src, uint32_t freq);

/*! brief Enable USB HS clock.
 *
 * This function only enables the access to USB HS prepheral, upper layer
 * should first call the ref CLOCK_EnableUsbhs0PhyPllClock to enable the PHY
 * clock to use USB HS.
 *
 * param src  USB HS does not care about the clock source, here must be ref kCLOCK_UsbSrcUnused.
 * param freq USB HS does not care about the clock source, so this parameter is ignored.
 * retval true The clock is set successfully.
 * retval false The clock source is invalid to get proper USB HS clock.
 */
bool CLOCK_EnableUsbhs0Clock(clock_usb_src_t src, uint32_t freq);

/*! brief Disable USB HS PHY PLL clock.
 *
 * This function disables USB HS PHY PLL clock.
 */
void CLOCK_DisableUsbhs0PhyPllClock(void);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* FSL_CLOCK_H_ */
